Домашняя_работа/src/Documents/ПоступлениеТоваровИУслуг/ПоступлениеТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровИУслуг</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Домашняя_работа/src/Documents/ПоступлениеТоваровИУслуг/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Выбранное Из ВыбранноеЗначение Цикл
		Отбор = Новый Структура("Номенклатура", Выбранное.Номенклатура);
		Найденные = Объект.Товары.НайтиСтроки(Отбор);
		Если Найденные.Количество() = 0 Тогда
			НоваяСтрока = Объект.Товары.Добавить();
			НоваяСтрока.Номенклатура = Выбранное.Номенклатура;
			НоваяСтрока.Количество = Выбранное.Количество;
		Иначе
			НайденнаяСтрока = Найденные[0];
			НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + Выбранное.Количество;
			НайденнаяСтрока.Сумма = НайденнаяСтрока.Цена * НайденнаяСтрока.Количество; 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораСписком", ПараметрыФормы, Элементы.Товары);
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоСумме(Команда)
	СортироватьПоВозрастанию = Не СортироватьПоВозрастанию;
	Если СортироватьПоВозрастанию Тогда
		Объект.Товары.Сортировать("Сумма Возр");
		ИзменитьКартинку()
	Иначе	
		Объект.Товары.Сортировать("Сумма Убыв");
		ИзменитьКартинку()
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьКартинку()
	Если СортироватьПоВозрастанию Тогда
		Команды.СортироватьПоСумме.Картинка = БиблиотекаКартинок.ОформлениеТреугольникВверхЗеленый;
	Иначе
		Команды.СортироватьПоСумме.Картинка = БиблиотекаКартинок.ОформлениеТреугольникВнизКрасный;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПересчитатьСуммуСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПересчитатьСуммуСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуСтроки()
	ТекущиеДанныеТаблицы = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанныеТаблицы.Сумма = ТекущиеДанныеТаблицы.Количество * ТекущиеДанныеТаблицы.Цена;
КонецПроцедуры
